eu.alert-project.iccs.events.core/src/test/resources/ALERT.KEUI.IssueNew.Annotated.Converter.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2">
    <soap:Header></soap:Header>
    <soap:Body>
        <wsnt:Notify>
            <wsnt:NotificationMessage>
                <wsnt:Topic></wsnt:Topic>
                <wsnt:ProducerReference>
                    <wsa:Address>http://www.alert-project.eu/metadata</wsa:Address>
                </wsnt:ProducerReference>
                <wsnt:Message>
                    <ns1:event xmlns:ns1="http://www.alert-project.eu/"
                               xmlns:o="http://www.alert-project.eu/ontoevents-mdservice"
                               xmlns:s="http://www.alert-project.eu/strevents-kesi"
                               xmlns:s1="http://www.alert-project.eu/strevents-keui"
                               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                        <ns1:head>
                            <ns1:sender>METADATASERVICE</ns1:sender>
                            <ns1:timestamp>10003</ns1:timestamp>
                            <ns1:sequencenumber>1</ns1:sequencenumber>
                        </ns1:head>
                        <ns1:payload>
                            <ns1:meta>
                                <ns1:startTime>10010</ns1:startTime>
                                <ns1:endTime>10020</ns1:endTime>
                                <ns1:eventName>ALERT.KEUI.IssueNew.Annotated</ns1:eventName>
                                <ns1:eventId>8e2e2133-937c-46e9-8ff1-d35b26853be6</ns1:eventId>
                                <ns1:eventType>reply</ns1:eventType>
                            </ns1:meta>
                            <ns1:eventData>
                                <s:kesi>
                                    <s:issueAssignedTo>
                                        <s:email>ervin</s:email>
                                        <s:name>Kevin Ottens</s:name>
                                        <s:id>ervin</s:id>
                                    </s:issueAssignedTo>
                                    <s:issueComment>
                                        <s:commentText>Created attachment 50852
                                            screenshot

                                            Version:           unspecified (using KDE 4.5.0)
                                            OS:                Linux

                                            In kde 4.4.5 I had an oppportunity to set many parametres (even CPU freq.) And now these parametres are inactive. And also clicking on the battary icon I can choose 3 profiles of powersaving only. But I have 5!

                                            Reproducible: Always




                                            OS: Linux (i686) release 2.6.33.5-desktop586-2mnb
                                            Compiler: gcc</s:commentText>
                                        <s:commentPerson>
                                            <s:email>None</s:email>
                                            <s:name>None</s:name>
                                            <s:id>fe-pavel</s:id>
                                        </s:commentPerson>
                                        <s:commentDate>2010-08-23 08:35:00.0</s:commentDate>
                                    </s:issueComment>
                                    <s:issueComputerSystem>
                                        <s:computerSystemOS>Linux</s:computerSystemOS>
                                        <s:computerSystemPlatform>Mandriva RPMs</s:computerSystemPlatform>
                                    </s:issueComputerSystem>
                                    <s:issueDateOpened>2010-08-23T08:35:00+02:00</s:issueDateOpened>
                                    <s:issueDescription>I can ' t find extend settings (CPU policy etc)</s:issueDescription>
                                    <s:issueId>248762</s:issueId>
                                    <s:issueTracker>
                                        <s:issueTrackerType>bugzilla</s:issueTrackerType>
                                        <s:issueTrackerURL>https://bugs.kde.org/</s:issueTrackerURL>
                                    </s:issueTracker>
                                    <s:issueUrl>https://bugs.kde.org/show_bug.cgi?id=248762</s:issueUrl>
                                    <s:issueMilestone>
                                        <s:milestoneId>---</s:milestoneId>
                                    </s:issueMilestone>
                                    <s:issuePriority></s:issuePriority>
                                    <s:issueProduct>
                                        <s:productComponentId>powermanagement-kcm</s:productComponentId>
                                        <s:productId>solid</s:productId>
                                        <s:productVersion>unspecified</s:productVersion>
                                    </s:issueProduct>
                                    <s:issueAuthor>
                                        <s:email>None</s:email>
                                        <s:name>None</s:name>
                                        <s:id>fe-pavel</s:id>
                                    </s:issueAuthor>
                                    <s:issueResolution>Duplicate</s:issueResolution>
                                    <s:issueSeverity>Normal</s:issueSeverity>
                                    <s:issueStatus>Resolved</s:issueStatus>
                                </s:kesi>
                                <o:mdservice>
                                    <o:issueUri>http://www.alert-project.eu/ontologies/alert_its.owl#Bug530</o:issueUri>
                                    <o:issueComment>
                                        <o:commentUri>http://www.ifi.uzh.ch/ddis/evoont/2008/11/bom#Comment530</o:commentUri>
                                        <o:commentPersonUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person427</o:commentPersonUri>
                                    </o:issueComment>
                                    <o:issueComputerSystem>
                                        <o:issueComputerSystemUri>http://www.ifi.uzh.ch/ddis/evoont/2008/11/bom#ComputerSystem530</o:issueComputerSystemUri>
                                    </o:issueComputerSystem>
                                    <o:issueMilestone>
                                        <o:issueMilestoneUri>http://www.ifi.uzh.ch/ddis/evoont/2008/11/bom#Milestone1</o:issueMilestoneUri>
                                    </o:issueMilestone>
                                    <o:issueAuthorUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person427</o:issueAuthorUri>
                                    <o:issueAssignedToUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person45</o:issueAssignedToUri>
                                    <o:issueProduct>
                                        <o:productComponentUri>http://www.ifi.uzh.ch/ddis/evoont/2008/11/bom#Component7</o:productComponentUri>
                                        <o:productUri>http://www.ifi.uzh.ch/ddis/evoont/2008/11/bom#Product1</o:productUri>
                                    </o:issueProduct>
                                </o:mdservice>

                                <s1:keui>
                                    <s1:issueDescriptionAnnotated><![CDATA[I can ' t <concept id="http://ailab.ijs.si/alert/resource/find">find</concept> <concept id="http://ailab.ijs.si/alert/resource/extend">extend</concept> <concept id="http://ailab.ijs.si/alert/resource/configuration">settings</concept> (<concept id="http://ailab.ijs.si/alert/resource/microprocessor">CPU</concept> <concept id="http://ailab.ijs.si/alert/resource/policy">policy</concept> etc)]]></s1:issueDescriptionAnnotated>
                                    <s1:issueDescriptionConcepts><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/find</s1:uri><s1:weight>,0001</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/extend</s1:uri><s1:weight>14</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/configuration</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/microprocessor</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/policy</s1:uri><s1:weight>0,0002</s1:weight></s1:concept></s1:issueDescriptionConcepts>
                                    <s1:issueComment>
                                        <s1:commentTextAnnotated><![CDATA[Created <concept id="http://ailab.ijs.si/alert/resource/attachment">attachment</concept> 50852
 <concept id="http://ailab.ijs.si/alert/resource/screenshot">screenshot</concept> 
 
 <concept id="http://ailab.ijs.si/alert/resource/versioning">Version</concept>:           unspecified (using KDE 4.5.0)  
 <concept id="http://ailab.ijs.si/alert/resource/operating_systems">OS</concept>:                <concept id="http://ailab.ijs.si/alert/resource/linux">Linux</concept> 
 
 In kde 4.4.5 I had an oppportunity to set many parametres (even <concept id="http://ailab.ijs.si/alert/resource/microprocessor">CPU</concept> freq.) And now these parametres are inactive. And also <concept id="http://ailab.ijs.si/alert/resource/click">clicking</concept> on the battary <concept id="http://ailab.ijs.si/alert/resource/icons">icon</concept> I can choose 3 <concept id="http://ailab.ijs.si/alert/resource/profiling">profiles</concept> of powersaving only. But I have 5! 
 
 Reproducible: Always 
 
 
 
 
 <concept id="http://ailab.ijs.si/alert/resource/operating_systems">OS</concept>: <concept id="http://ailab.ijs.si/alert/resource/linux">Linux</concept> (i686) <concept id="http://ailab.ijs.si/alert/resource/release">release</concept> 2.6.33.5-desktop586-2mnb 
 <concept id="http://ailab.ijs.si/alert/resource/compiler">Compiler</concept>: <concept id="http://ailab.ijs.si/alert/resource/gcc">gcc</concept>]]></s1:commentTextAnnotated>
                                        <s1:commentTextConcepts><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/attachment</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/screenshot</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/versioning</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/operating_systems</s1:uri><s1:weight>2</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/linux</s1:uri><s1:weight>2</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/microprocessor</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/click</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/icons</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/profiling</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/release</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/compiler</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/gcc</s1:uri><s1:weight>1</s1:weight></s1:concept></s1:commentTextConcepts><s1:itemId>25416</s1:itemId></s1:issueComment><s1:threadId>530</s1:threadId>
                                </s1:keui>
                            </ns1:eventData>
                        </ns1:payload>
                    </ns1:event>
                </wsnt:Message>
            </wsnt:NotificationMessage>
        </wsnt:Notify>
    </soap:Body>
</soap:Envelope>
